app/views/users/display_article.html.erb

    <tr>
      <td><%= link_to t.first.article.name, user_article_path(id: t.first.article_id, user_id: t.first.article.user_id), :class => "btn btn-link btn-sm"%></td>
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`user_id` = 1  ORDER BY `articles`.`id` ASC LIMIT 1