app/controllers/articles_controller.rb

  def show
    @article= Article.find(params[:id])
    @list_of_publisher=[]
    @list_of_requested=[]
    ArticlesPublisher.where(article_id: params[:id]).each do |obj|
      if obj.buy_approval==true
        @list_of_publisher<< User.find(obj.publisher)
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 12 LIMIT 1
SELECT  `articles_publishers`.* FROM `articles_publishers`  WHERE `articles_publishers`.`article_id` = 3  ORDER BY `articles_publishers`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 2  ORDER BY `users`.`id` ASC LIMIT 1

  def create
    @article = Article.new(article_params)
    @article.user_id= params[:user_id].to_i

    if @article.save!
---
INSERT INTO `articles` (`content`, `created_at`, `name`, `updated_at`, `user_id`) VALUES ('The :value_method and :text_method parameters are methods to be called on each member of coll', '2014-08-12 13:50:08', 'stephen richrds', '2014-08-12 13:50:08', 1)

  def destroy
    @article.destroy
---
DELETE FROM `articles` WHERE `articles`.`id` = 9

  def set_article
    @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`id` = 9 LIMIT 1