app/controllers/users_controller.rb

SELECT  `articles`.* FROM `articles`  WHERE (name LIKE '%two%')  ORDER BY `articles`.`id` ASC LIMIT 1
---
  def show
    @article = Article.search(params[:search])

UPDATE `users` SET `role` = 'admin', `updated_at` = '2014-08-12 11:33:16' WHERE `users`.`id` = 1
---
  def update
    respond_to do |format|
      if @user.update(user_params)

SELECT  `articles`.* FROM `articles`  WHERE `articles`.`user_id` = 1  ORDER BY `articles`.`id` ASC LIMIT 1
SELECT  `articles_publishers`.* FROM `articles_publishers`  WHERE `articles_publishers`.`buy_approval` = 1  ORDER BY `articles_publishers`.`id` ASC LIMIT 1
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`user_id` = 2 AND `articles`.`buy_approval` = 1  ORDER BY `articles`.`id` ASC LIMIT 1
---
  def display_article
    @arr_objects=current_user.articles
    @articles_published=[]
    current_user.articles.each do |g|
      if g.articles_publishers.buy_approval_true.first!=nil

SELECT  `articles_publishers`.* FROM `articles_publishers`  WHERE `articles_publishers`.`Publisher_id` = 3  ORDER BY `articles_publishers`.`id` ASC LIMIT 1
SELECT  `articles`.* FROM `articles`  WHERE `articles`.`admin_approval` = 1  ORDER BY `articles`.`id` ASC LIMIT 1
---
  def articles_for_publisher
    @all_published=Article.admin_approval
    if current_user.articles_publishers.first!=nil
      @article_for_publisher=[]
      Article.admin_approval.each do |a|

INSERT INTO `articles_publishers` (`article_id`, `buy_request`, `created_at`, `publisher_id`, `updated_at`) VALUES (1, 1, '2014-08-16 07:21:27', 3, '2014-08-16 07:21:27')
---
  def publisher_request_to_admin_to_buy
    request_to_admin_to_buy.each do |article|
      current_user.articles_publishers.create(article_id: article, buy_request: true)

SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 3  ORDER BY `users`.`id` ASC LIMIT 1
---
  def set_user
    @user = User.find(params[:id])